.data   
newline:    .asciiz "\n"                # 定义一个字符串，用于输出换行。
.text   
            .globl  main                #声明main函数为全局符号，使得模拟器能识别程序的入口点
main:       
    move    $fp,    $sp                 # 设置帧指针
    addiu   $sp,    $sp,        -0x100  # 为局部变量分配栈空间(暂时设置为固定值，后续可设置为进行字符串替换)
########################################
{{target}}
########################################
    li      $v0,    0
    move    $v1,    $v0                 # 设置返回值
    li      $v0,    10                  # 设置系统调用号为 1010，即退出程序
    syscall                             # 系统调用